Котельников_АБ_70153995/src/Documents/ЗакрытиеВакансии/ЗакрытиеВакансии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакрытиеВакансии</name>
  <basedOn>Document.Вакансия</basedOn>
  <attributes>
    <name>Вакансия</name>
    <type>
      <types>DocumentRef.Вакансия</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВакансии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаЗакрытия</name>
    <type>
      <types>EnumRef.ПричиныЗакрытияВакансий</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПричины</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаВакансию</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АвторДокумента</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

Котельников_АБ_70153995/src/Enums/ПричиныЗакрытияВакансий/ПричиныЗакрытияВакансий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПричиныЗакрытияВакансий</name>
  <enumValues>
    <name>НайденКандидат</name>
  </enumValues>
  <enumValues>
    <name>ОтсутствиеПодходящихКандидатов</name>
  </enumValues>
  <enumValues>
    <name>ОтсутствиеОткликовНаВакансию</name>
  </enumValues>
  <enumValues>
    <name>ПересмотрУсловийВакансии</name>
  </enumValues>
  <enumValues>
    <name>ДругаяПричина</name>
  </enumValues>
</mdclass:Enum>

Котельников_АБ_70153995/src/Documents/ЗакрытиеВакансии/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОпределениеВидимостиОписанияЗакрытия();
КонецПроцедуры

&НаКлиенте
Процедура ПричинаЗакрытияПриИзменении(Элемент)	
	ОпределениеВидимостиОписанияЗакрытия();		
КонецПроцедуры

&НаКлиенте
Процедура ОпределениеВидимостиОписанияЗакрытия()

	Если Объект.ПричинаЗакрытия = ПредопределенноеЗначение("Перечисление.ПричиныЗакрытияВакансий.ДругаяПричина") Тогда
		Элементы.ОписаниеПричины.Видимость = Истина;
	Иначе
		Элементы.ОписаниеПричины.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры
